Load Data

In [1]:
#import libraries
import pandas as pd
from sqlalchemy import create_engine

In [2]:
#create connection engine to the mysql db
connection_string = 'mysql://lucab:lucab@127.0.0.1:3306/nbamvp_pred'
engine = create_engine(connection_string)

In [3]:
#get tables out of the mysql databse and save them into dataframes
mvps = pd.read_sql_table('mvps_tbl', engine)
players = pd.read_sql_table('players_tbl', engine)
teams = pd.read_sql_table('teams_tbl', engine)
arenas = pd.read_sql_table('arenas_tbl', engine)

Spieler (MVP & Players)

In [4]:
mvps.head(1)

,Rank,Player,Age,Tm,First,Pts Won,Pts Max,Share,G,MP,...,TRB,AST,STL,BLK,FG%,3P%,FT%,WS,WS/48,Year
0,1,Shaquille O'Neal,27,LAL,120.0,1207.0,1210,0.998,79,40.0,...,13.6,3.8,0.5,3.0,0.574,0.0,0.524,18.6,0.283,2000

In [5]:
#only leave some of the columns in the mvps df
mvps = mvps[["Player", "Year", "Pts Won", "Pts Max", "Share"]]

In [6]:
mvps.head(1)

             Player  Year  Pts Won  Pts Max  Share
0  Shaquille O'Neal  2000   1207.0     1210  0.998

In [7]:
players.head(1)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Year
0,1,Tariq Abdul-Wahad,SG,25,TOT,61,56,25.9,4.5,10.6,...,1.7,3.1,4.8,1.6,1.0,0.5,1.7,2.4,11.4,2000

In [8]:
#Unnötige Spalten löschen
del players['Rk'] #Spalte mit Rank

In [9]:
players.head(1)

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Year
0,Tariq Abdul-Wahad,SG,25,TOT,61,56,25.9,4.5,10.6,.424,...,1.7,3.1,4.8,1.6,1.0,0.5,1.7,2.4,11.4,2000

In [10]:
#Alle "*" löschen
players["Player"] = players["Player"].str.replace("*","", regex=False)

In [11]:
players[players["Player"] == "Tariq Abdul-Wahad"]

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Year
0,Tariq Abdul-Wahad,SG,25,TOT,61,56,25.9,4.5,10.6,.424,...,1.7,3.1,4.8,1.6,1.0,0.5,1.7,2.4,11.4,2000
1,Tariq Abdul-Wahad,SG,25,ORL,46,46,26.2,4.8,11.2,.433,...,1.7,3.5,5.2,1.6,1.2,0.3,1.9,2.5,12.2,2000
2,Tariq Abdul-Wahad,SG,25,DEN,15,10,24.9,3.4,8.7,.389,...,1.6,1.9,3.5,1.7,0.4,0.8,1.3,2.1,8.9,2000
517,Tariq Abdul-Wahad,SG,26,DEN,29,12,14.5,1.5,3.8,.387,...,0.5,1.6,2.0,0.8,0.5,0.4,1.2,1.9,3.8,2001
1074,Tariq Abdul-Wahad,SG,27,TOT,24,12,18.4,2.3,6.1,.374,...,1.7,1.8,3.5,1.0,0.8,0.4,1.1,2.3,5.6,2002
1075,Tariq Abdul-Wahad,SG,27,DEN,20,12,20.9,2.8,7.3,.379,...,2.0,2.0,3.9,1.1,0.9,0.5,1.2,2.6,6.8,2002
1076,Tariq Abdul-Wahad,SG,27,DAL,4,0,6.0,0.0,0.5,.000,...,0.5,1.0,1.5,0.5,0.5,0.3,0.8,1.3,0.0,2002
1594,Tariq Abdul-Wahad,SG,28,DAL,14,0,14.6,1.9,4.1,.466,...,1.0,1.9,2.9,1.5,0.4,0.2,0.5,1.9,4.1,2003

In [12]:
#makes sure that for each player in each year, it only keeps one entry in the data. 
#if a player played for more than one team in a year, it only keeps the last team they played for.
def single_team(df):
    if df.shape[0]==1:
        return df
    else:
        row = df[df["Tm"]=="TOT"]
        row["Tm"] = df.iloc[-1,:]["Tm"]
        return row

players = players.groupby(["Player", "Year"]).apply(single_team)

C:\Users\lucab\AppData\Local\Temp\ipykernel_30736\3872991202.py:11: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  players = players.groupby(["Player", "Year"]).apply(single_team)

In [13]:
players.head(1)

,,,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Year
Player,Year,,,,,,,,,,,,,,,,,,,,,,
A.C. Green,2000,184,A.C. Green,PF,36,LAL,82,82,23.5,2.1,4.7,.447,...,2.0,4.0,5.9,1.0,0.6,0.2,0.6,1.5,5.0,2000

In [14]:
#Löscht die ersten 2 Spalten
players.index = players.index.droplevel()
players.index = players.index.droplevel()

In [15]:
players.head(1)

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Year
184,A.C. Green,PF,36,LAL,82,82,23.5,2.1,4.7,.447,...,2.0,4.0,5.9,1.0,0.6,0.2,0.6,1.5,5.0,2000

In [16]:
players[players["Player"] == "A.C. Green"]

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Year
184,A.C. Green,PF,36,LAL,82,82,23.5,2.1,4.7,.447,...,2.0,4.0,5.9,1.0,0.6,0.2,0.6,1.5,5.0,2000
703,A.C. Green,PF,37,MIA,82,1,17.2,1.8,4.0,.444,...,1.3,2.5,3.8,0.5,0.4,0.1,0.5,1.5,4.5,2001

In [17]:
#combine Player and MVP dataframes
combined = players.merge(mvps, how="outer", on=["Player", "Year"])

In [18]:
combined[combined["Pts Won"] > 0].head()

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,AST,STL,BLK,TOV,PF,PTS,Year,Pts Won,Pts Max,Share
172,Al Jefferson,C,29,CHA,73,73,35.0,9.6,18.8,.509,...,2.1,0.9,1.1,1.7,2.4,21.8,2014,34.0,1250.0,0.027
303,Allen Iverson,SG,24,PHI,70,70,40.8,10.4,24.8,.421,...,4.7,2.1,0.1,3.3,2.3,28.4,2000,132.0,1210.0,0.109
304,Allen Iverson,SG,25,PHI,71,71,42.0,10.7,25.5,.420,...,4.6,2.5,0.3,3.3,2.1,31.1,2001,1121.0,1240.0,0.904
305,Allen Iverson,SG,26,PHI,60,59,43.7,11.1,27.8,.398,...,5.5,2.8,0.2,4.0,1.7,31.4,2002,29.0,1260.0,0.023
306,Allen Iverson,SG,27,PHI,82,82,42.5,9.8,23.7,.414,...,5.5,2.7,0.2,3.5,1.8,27.6,2003,83.0,1190.0,0.070

In [20]:
combined.head(1)

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,AST,STL,BLK,TOV,PF,PTS,Year,Pts Won,Pts Max,Share
0,A.C. Green,PF,36,LAL,82,82,23.5,2.1,4.7,.447,...,1.0,0.6,0.2,0.6,1.5,5.0,2000,NaN,NaN,NaN

Teams & Arenas

In [21]:
teams.sort_values("Year", ascending=False).head()

,W,L,W/L%,GB,PS/G,PA/G,SRS,Year,Team
859,22,60,.268,28.0,112.1,118.6,-5.80,2024,San Antonio Spurs (14)
842,Northwest Division,Northwest Division,Northwest Division,Northwest Division,Northwest Division,Northwest Division,Northwest Division,2024,Northwest Division
840,21,61,.256,26.0,106.6,116.8,-10.12,2024,Charlotte Hornets (13)
839,36,46,.439,11.0,118.3,120.5,-2.38,2024,Atlanta Hawks (10)
838,46,36,.561,1.0,110.1,108.4,1.10,2024,Miami Heat* (8)

In [22]:
#Daten entfernen, die kein Team sind (meistens Tabellentitel)
teams = teams[~teams["W"].str.contains("Division")].copy()

In [23]:
#"*" in allen Werten löschen
teams["Team"] = teams["Team"].str.replace("*", "", regex=False)
#(XX) in Teams löschen
teams["Team"] = teams["Team"].str.replace(r"\(\d+\)", "", regex=True)
#"\xa0" löschen
teams["Team"] = teams["Team"].str.replace("\xa0", "", regex=False)

In [24]:
teams.sort_values("Year", ascending=False).head(1)

      W   L  W/L%    GB   PS/G   PA/G    SRS  Year               Team
859  22  60  .268  28.0  112.1  118.6  -5.80  2024  San Antonio Spurs

Arenas

In [25]:
arenas.head(1)

,Image,Arena,Location,Team(s),Capacity,Opened,Season of first NBA game,Ref(s),Latitude,Longitude
0,NaN,American_Airlines_Center,"Dallas, Texas",Dallas Mavericks,19200,2001,2001–02,[1][2],32.79056,-96.81028

In [26]:
#delete and rename some columns of the fd arenas
arenas = arenas.drop(columns=['Image', 'Arena', 'Location', 'Capacity', 'Opened', 
                              'Season of first NBA game', 'Ref(s)'])
arenas = arenas.rename(columns={'Team(s)': 'Team'})

In [27]:
arenas.head(1)

               Team  Latitude  Longitude
0  Dallas Mavericks  32.79056  -96.81028

Combine Teams and Arenas

In [28]:
#combine Teams and Arenas dataframes
teams = teams.merge(arenas, how="outer",on="Team")

In [29]:
teams.head(1)

,W,L,W/L%,GB,PS/G,PA/G,SRS,Year,Team,Latitude,Longitude
0,28,54,.341,28.0,94.3,99.7,-5.41,2000,Atlanta Hawks,33.75722,-84.39639

Add Teams to Players

In [30]:
#create a dictionary nicknames based on the nickname.csv file
nicknames = {}
with open("nicknames.csv") as f:
    lines = f.readlines()
    for line in lines[1:]:
        abbrev,name = line.replace("\n","").split(",")
        nicknames[abbrev] = name

In [31]:
#Add column "Team" to combined filled with the values of the nicknames
combined["Team"] = combined["Tm"].map(nicknames)

In [32]:
combined.head(1)

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,STL,BLK,TOV,PF,PTS,Year,Pts Won,Pts Max,Share,Team
0,A.C. Green,PF,36,LAL,82,82,23.5,2.1,4.7,.447,...,0.6,0.2,0.6,1.5,5.0,2000,NaN,NaN,NaN,Los Angeles Lakers

In [33]:
#dataframe combined and teams are combined based on the columns Team and Year
nbapred_df = combined.merge(teams, how="outer",on=["Team", "Year"])

In [34]:
nbapred_df.sort_values("Year", ascending=False).head(1)

,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,...,Team,W,L,W/L%,GB,PS/G,PA/G,SRS,Latitude,Longitude
12090,Tyus Jones,PG,27,WAS,66,66,29.3,4.9,10.1,.489,...,Washington Wizards,15,67,.183,32.0,113.7,123.0,-9.29,38.89806,-77.02083

In [35]:
#switch NaN to 0
nbapred_df = nbapred_df.fillna(0)

In [36]:
nbapred_df["GB"].unique()

array(['28.0', '27.0', '17.0', '15.0', '33.0', '46.0', '26.0', '14.0',
       '12.0', '6.0', '22.0', '16.0', '—', '20.0', '13.0', '21.0', '10.0',
       '3.0', '11.0', '5.0', '23.0', '12.5', '9.0', '8.0', '4.0', '35.0',
       '31.0', '18.0', '1.0', '7.0', '32.0', '41.0', '24.0', '39.0',
       '45.0', '37.0', '29.0', '38.0', '25.0', '4.5', '30.0', '43.0',
       '25.5', '2.5', '34.0', '20.5', '19.0', '32.5', '48.0', '40.0',
       '36.0', '2.0', '52.0', '3.5', '56.0', '10.5', '11.5', '22.5',
       '1.5', '50.0', '21.5', '18.5'], dtype=object)

In [37]:
#switch "-" to "0" (GB => Team stat, Games Behind)
nbapred_df["GB"] = pd.to_numeric(nbapred_df["GB"].str.replace("—","0"))

In [38]:
#wandelt die Werte in numerische Typen um
nbapred_df = nbapred_df.apply(pd.to_numeric, errors='ignore')

C:\Users\lucab\AppData\Local\Temp\ipykernel_30736\1465843382.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead
  nbapred_df = nbapred_df.apply(pd.to_numeric, errors='ignore')

In [39]:
#save the dataframe "nbapred_df" to the mysql database
nbapred_df.to_sql(name='player_mvp_stats_tbl', con=engine, if_exists='replace', index=False)

12091

In [40]:
import os
import platform
import socket
from platform import python_version
from datetime import datetime

print('-----------------------------------')
print(os.name.upper())
print(platform.system(), '|', platform.release())
print('Datetime:', datetime.now().strftime("%Y-%m-%d %H:%M:%S"))
print('Python Version:', python_version())
print('-----------------------------------')

-----------------------------------
NT
Windows | 10
Datetime: 2024-05-07 11:46:19
Python Version: 3.10.13
-----------------------------------